In [2]:
import numpy as np
import pandas as pd

In [3]:
pd.__version__

'1.5.1'

### New Data: New York City SAT Scores

https://andybek.com/pandas-sat

In [4]:
sat_url = 'https://andybek.com/pandas-sat'

In [5]:
import ssl

ssl._create_default_https_context = ssl._create_unverified_context
sat = pd.read_csv(sat_url)
sat.head(n=5)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.00%,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.90%,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.90%,Reading,422

In [6]:
sat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1125 entries, 0 to 1124
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   School Name         1125 non-null   object
 1   Borough             1125 non-null   object
 2   Student Enrollment  1125 non-null   int64
 3   Percent Tested      1125 non-null   object
 4   SAT Section         1125 non-null   object
 5   Score               1125 non-null   int64
dtypes: int64(2), object(4)
memory usage: 52.9+ KB

In [7]:
sat['Percent Tested'] = sat['Percent Tested'].replace(regex='%', value='').astype(float)

In [8]:
sat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1125 entries, 0 to 1124
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   School Name         1125 non-null   object
 1   Borough             1125 non-null   object
 2   Student Enrollment  1125 non-null   int64
 3   Percent Tested      1125 non-null   float64
 4   SAT Section         1125 non-null   object
 5   Score               1125 non-null   int64
dtypes: float64(1), int64(2), object(3)
memory usage: 52.9+ KB

In [9]:
sat.head(9)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
5,Abraham Lincoln High School,Brooklyn,2341,54.9,Writing,422
6,Academy for Careers in Television and Film,Queens,515,95.0,Math,444
7,Academy for Careers in Television and Film,Queens,515,95.0,Reading,458
8,Academy for Careers in Television and Film,Queens,515,95.0,Writing,444

In [10]:
sat.set_index(['School Name','SAT Section']).loc[:,['Score']]

                                                        Score
School Name                                SAT Section
A. Philip Randolph Campus High School      Math           459
                                           Reading        453
                                           Writing        447
Abraham Lincoln High School                Math           441
                                           Reading        422
...                                                       ...
Young Women's Leadership School in Astoria Reading        464
                                           Writing        477
Young Women's Leadership School in Queens  Math           415
                                           Reading        420
                                           Writing        433

[1125 rows x 1 columns]

In [11]:
sat.set_index(['School Name','SAT Section']).loc[:,['Score']].unstack(level=1)

                                                   Score
SAT Section                                         Math Reading Writing
School Name
A. Philip Randolph Campus High School                459     453     447
ACORN Community High School                          379     395     385
Abraham Lincoln High School                          441     422     422
Academy for Careers in Television and Film           444     458     444
Academy for College Preparation and Career Expl...   386     397     393
...                                                  ...     ...     ...
World Journalism Preparatory (College Board)         484     491     487
York Early College Academy                           496     481     473
Young Women's Leadership School                      478     465     472
Young Women's Leadership School in Astoria           483     464     477
Young Women's Leadership School in Queens            415     420     433

[375 rows x 3 columns]

In [12]:
sat.head(9)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
5,Abraham Lincoln High School,Brooklyn,2341,54.9,Writing,422
6,Academy for Careers in Television and Film,Queens,515,95.0,Math,444
7,Academy for Careers in Television and Film,Queens,515,95.0,Reading,458
8,Academy for Careers in Television and Film,Queens,515,95.0,Writing,444

In [13]:
# sat.pivot('School Name','SAT Section','Score')

# /var/folders/kz/w63f9yjx2rs32jgdg8wkn4w40000gn/T/ipykernel_4721/3884265074.py:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
#  sat.pivot('School Name','SAT Section','Score')

In [14]:
sat.pivot(index='School Name', columns='SAT Section', values='Score')

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [15]:
pivoted = sat.pivot(index='School Name', columns='SAT Section', values='Score')

In [16]:
pivoted.head(n=11)

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
Academy for Conservation and the Environment         381      397      390
Academy for Environmental Leadership                 365      366      348
Academy for Health Careers                           406      405      396
Academy for Language and Technology                  371      334      348
Academy for Scholarship and Entrepreneurship (C...   392      408      400
Academy for Social Action (College Board)            357      349      365

# UNDOING PIVOTS

In [17]:
# Q: how do do you 'undo' a pivot?

In [18]:
# the 'cheat':

# scores_by_borough = scores pivoted by brough
# scores_by_school = scores pivoted by school
# enrollment_by_school = enrollment pivoted by shool
# ...

In [19]:
pivoted

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [20]:
pivoted.stack()

School Name                                 SAT Section
A. Philip Randolph Campus High School       Math           459
                                            Reading        453
                                            Writing        447
ACORN Community High School                 Math           379
                                            Reading        395
                                                          ...
Young Women's Leadership School in Astoria  Reading        464
                                            Writing        477
Young Women's Leadership School in Queens   Math           415
                                            Reading        420
                                            Writing        433
Length: 1125, dtype: int64

In [21]:
pivoted.stack().index

MultiIndex([(     'A. Philip Randolph Campus High School',    'Math'),
            (     'A. Philip Randolph Campus High School', 'Reading'),
            (     'A. Philip Randolph Campus High School', 'Writing'),
            (               'ACORN Community High School',    'Math'),
            (               'ACORN Community High School', 'Reading'),
            (               'ACORN Community High School', 'Writing'),
            (               'Abraham Lincoln High School',    'Math'),
            (               'Abraham Lincoln High School', 'Reading'),
            (               'Abraham Lincoln High School', 'Writing'),
            ('Academy for Careers in Television and Film',    'Math'),
            ...
            (                'York Early College Academy', 'Writing'),
            (           'Young Women's Leadership School',    'Math'),
            (           'Young Women's Leadership School', 'Reading'),
            (           'Young Women's Leadership School', 'Writing'),
            ('Young Women's Leadership School in Astoria',    'Math'),
            ('Young Women's Leadership School in Astoria', 'Reading'),
            ('Young Women's Leadership School in Astoria', 'Writing'),
            ( 'Young Women's Leadership School in Queens',    'Math'),
            ( 'Young Women's Leadership School in Queens', 'Reading'),
            ( 'Young Women's Leadership School in Queens', 'Writing')],
           names=['School Name', 'SAT Section'], length=1125)

In [22]:
pivoted.stack().reset_index()

                                     School Name SAT Section    0
0          A. Philip Randolph Campus High School        Math  459
1          A. Philip Randolph Campus High School     Reading  453
2          A. Philip Randolph Campus High School     Writing  447
3                    ACORN Community High School        Math  379
4                    ACORN Community High School     Reading  395
...                                          ...         ...  ...
1120  Young Women's Leadership School in Astoria     Reading  464
1121  Young Women's Leadership School in Astoria     Writing  477
1122   Young Women's Leadership School in Queens        Math  415
1123   Young Women's Leadership School in Queens     Reading  420
1124   Young Women's Leadership School in Queens     Writing  433

[1125 rows x 3 columns]

In [23]:
pivoted.melt()

     SAT Section  value
0           Math    459
1           Math    379
2           Math    441
3           Math    444
4           Math    386
...          ...    ...
1120     Writing    487
1121     Writing    473
1122     Writing    472
1123     Writing    477
1124     Writing    433

[1125 rows x 2 columns]

In [24]:
# the melt() method

In [25]:
pivoted.melt()

     SAT Section  value
0           Math    459
1           Math    379
2           Math    441
3           Math    444
4           Math    386
...          ...    ...
1120     Writing    487
1121     Writing    473
1122     Writing    472
1123     Writing    477
1124     Writing    433

[1125 rows x 2 columns]

In [26]:
pivoted

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [27]:
pivoted.melt().index

RangeIndex(start=0, stop=1125, step=1)

In [28]:
pivoted.reset_index().melt()

      SAT Section                                              value
0     School Name              A. Philip Randolph Campus High School
1     School Name                        ACORN Community High School
2     School Name                        Abraham Lincoln High School
3     School Name         Academy for Careers in Television and Film
4     School Name  Academy for College Preparation and Career Exp...
...           ...                                                ...
1495      Writing                                                487
1496      Writing                                                473
1497      Writing                                                472
1498      Writing                                                477
1499      Writing                                                433

[1500 rows x 2 columns]

In [29]:
pivoted.reset_index().melt(id_vars='School Name')

                                            School Name SAT Section  value
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

In [30]:
pivoted.reset_index().melt(id_vars='School Name').index

RangeIndex(start=0, stop=1125, step=1)

In [31]:
pivoted.reset_index().melt(id_vars='School Name', value_name='Score')

                                            School Name SAT Section  Score
0                 A. Philip Randolph Campus High School        Math    459
1                           ACORN Community High School        Math    379
2                           Abraham Lincoln High School        Math    441
3            Academy for Careers in Television and Film        Math    444
4     Academy for College Preparation and Career Exp...        Math    386
...                                                 ...         ...    ...
1120       World Journalism Preparatory (College Board)     Writing    487
1121                         York Early College Academy     Writing    473
1122                    Young Women's Leadership School     Writing    472
1123         Young Women's Leadership School in Astoria     Writing    477
1124          Young Women's Leadership School in Queens     Writing    433

[1125 rows x 3 columns]

# What about Aggregates?

In [32]:
pivoted.head(n=3)

SAT Section                            Math  Reading  Writing
School Name
A. Philip Randolph Campus High School   459      453      447
ACORN Community High School             379      395      385
Abraham Lincoln High School             441      422      422

In [33]:
sat.head(n=3)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447

In [34]:
sat.Borough.unique()

array(['Manhattan', 'Brooklyn', 'Queens', 'Bronx', 'Staten Island'],
      dtype=object)

In [35]:
# Q: What is the average SAT score by borough?

In [36]:
# sat.pivot(index='Borough', columns='SAT Section', values='Score')

# ValueError: Index contains duplicate entries, cannot reshape

In [37]:
sat.set_index('Borough').head(n=5)

,School Name,Student Enrollment,Percent Tested,SAT Section,Score
Borough,,,,,
Manhattan,A. Philip Randolph Campus High School,1354,74.0,Math,459
Manhattan,A. Philip Randolph Campus High School,1354,74.0,Reading,453
Manhattan,A. Philip Randolph Campus High School,1354,74.0,Writing,447
Brooklyn,Abraham Lincoln High School,2341,54.9,Math,441
Brooklyn,Abraham Lincoln High School,2341,54.9,Reading,422

In [38]:
sat.set_index('School Name')

,Borough,Student Enrollment,Percent Tested,SAT Section,Score
School Name,,,,,
A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447
Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441
Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422
...,...,...,...,...,...
Young Women's Leadership School in Astoria,Queens,572,100.0,Reading,464
Young Women's Leadership School in Astoria,Queens,572,100.0,Writing,477
Young Women's Leadership School in Queens,Queens,557,90.4,Math,415
Young Women's Leadership School in Queens,Queens,557,90.4,Reading,420
Young Women's Leadership School in Queens,Queens,557,90.4,Writing,433

# The pivot_table()
## previously:
sat.pivot(index='Borough',columns='SAT Section',values='Score')

In [39]:
sat.pivot_table(values='Score',index='Borough',columns='SAT Section')

SAT Section          Math     Reading     Writing
Borough
Bronx          404.357143  402.520408  395.846939
Brooklyn       416.403670  410.761468  403.091743
Manhattan      455.887640  444.932584  439.314607
Queens         462.362319  443.260870  439.855072
Staten Island  486.200000  478.500000  474.300000

In [40]:
sat.pivot_table(values='Score',index='Borough',columns='SAT Section', aggfunc='mean')

SAT Section          Math     Reading     Writing
Borough
Bronx          404.357143  402.520408  395.846939
Brooklyn       416.403670  410.761468  403.091743
Manhattan      455.887640  444.932584  439.314607
Queens         462.362319  443.260870  439.855072
Staten Island  486.200000  478.500000  474.300000

In [41]:
sat.pivot_table(values='Score',index='Borough',columns='SAT Section', aggfunc='std')

SAT Section         Math    Reading    Writing
Borough
Bronx          52.215898  49.224340  51.304298
Brooklyn       60.481420  48.914684  49.657072
Manhattan      83.818315  73.930987  76.387707
Queens         71.890229  61.712724  66.233383
Staten Island  83.132825  66.850164  72.671330

In [42]:
# Q: Whta is the avrage percent tested by borough?

In [43]:
sat.head(n=3)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447

In [44]:
sat.pivot_table(values='Percent Tested',index='Borough',aggfunc='min')

               Percent Tested
Borough
Bronx                    19.2
Brooklyn                 18.5
Manhattan                30.6
Queens                   26.3
Staten Island            38.0

In [45]:
sat.pivot_table(values='Percent Tested', index='Borough', aggfunc='mean')

               Percent Tested
Borough
Bronx               58.220408
Brooklyn            62.423853
Manhattan           71.197753
Queens              69.036232
Staten Island       67.390000

In [46]:
sat.pivot_table(values='Percent Tested', index='Borough',aggfunc='max')

               Percent Tested
Borough
Bronx                    97.0
Brooklyn                 98.1
Manhattan               100.0
Queens                  100.0
Staten Island            99.7

In [47]:
sat.pivot_table(values='Percent Tested', index='Borough',aggfunc='std')

               Percent Tested
Borough
Bronx               18.620158
Brooklyn            17.237089
Manhattan           17.673607
Queens              19.448745
Staten Island       17.959405

# BOUNS: The problem with average percentage

In [48]:
sat.pivot_table(values='Percent Tested', index='Borough', aggfunc='mean')

               Percent Tested
Borough
Bronx               58.220408
Brooklyn            62.423853
Manhattan           71.197753
Queens              69.036232
Staten Island       67.390000

In [49]:
sat.head(n=2)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453

In [50]:
sat['SAT Takers'] = sat.loc[:,'Percent Tested'] * sat.loc[:,'Student Enrollment'] / 100

In [51]:
sat.head()

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score,SAT Takers
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459,1001.960
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453,1001.960
2,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Writing,447,1001.960
3,Abraham Lincoln High School,Brooklyn,2341,54.9,Math,441,1285.209
4,Abraham Lincoln High School,Brooklyn,2341,54.9,Reading,422,1285.209

In [52]:
sat.pivot_table(values='Student Enrollment',index='Borough',aggfunc='sum')

               Student Enrollment
Borough
Bronx                      159267
Brooklyn                   242814
Manhattan                  170370
Queens                     232437
Staten Island               55380

In [53]:
sat.pivot_table(values='SAT Takers',index='Borough',aggfunc='mean')

                SAT Takers
Borough
Bronx           322.523888
Brooklyn        498.704807
Manhattan       477.360876
Queens          747.937551
Staten Island  1271.262500

In [54]:
sat.groupby(['Borough'])[['Student Enrollment','SAT Takers']].apply(lambda sg: sg['SAT Takers'].mean() / sg['Student Enrollment'].mean()).nlargest(11)

Borough
Manhattan        0.748109
Staten Island    0.688658
Brooklyn         0.671611
Queens           0.666086
Bronx            0.595365
dtype: float64

# Replicating pivot tables with GroupBy

In [55]:
sat.pivot_table('Score','Borough','SAT Section')

SAT Section          Math     Reading     Writing
Borough
Bronx          404.357143  402.520408  395.846939
Brooklyn       416.403670  410.761468  403.091743
Manhattan      455.887640  444.932584  439.314607
Queens         462.362319  443.260870  439.855072
Staten Island  486.200000  478.500000  474.300000

In [56]:
sat.groupby(['Borough','SAT Section']).agg({'Score':'mean'}).unstack()

                    Score
SAT Section          Math     Reading     Writing
Borough
Bronx          404.357143  402.520408  395.846939
Brooklyn       416.403670  410.761468  403.091743
Manhattan      455.887640  444.932584  439.314607
Queens         462.362319  443.260870  439.855072
Staten Island  486.200000  478.500000  474.300000

In [57]:
sat.pivot_table(values='Score',index='Borough',columns='SAT Section')

SAT Section          Math     Reading     Writing
Borough
Bronx          404.357143  402.520408  395.846939
Brooklyn       416.403670  410.761468  403.091743
Manhattan      455.887640  444.932584  439.314607
Queens         462.362319  443.260870  439.855072
Staten Island  486.200000  478.500000  474.300000

# Adding Margins

In [58]:
sat.pivot_table(values='Score',index='Borough',columns='SAT Section',aggfunc='mean', margins=True)

SAT Section          Math     Reading     Writing         All
Borough
Bronx          404.357143  402.520408  395.846939  400.908163
Brooklyn       416.403670  410.761468  403.091743  410.085627
Manhattan      455.887640  444.932584  439.314607  446.711610
Queens         462.362319  443.260870  439.855072  448.492754
Staten Island  486.200000  478.500000  474.300000  479.666667
All            432.944000  424.504000  418.458667  425.302222

In [59]:
sat[sat.Borough == 'Manhattan'].Score.mean()

446.7116104868914

In [60]:
sat.Score.mean()

425.3022222222222

In [61]:
sat.pivot_table('Score','Borough')

                    Score
Borough
Bronx          400.908163
Brooklyn       410.085627
Manhattan      446.711610
Queens         448.492754
Staten Island  479.666667

In [62]:
sat.pivot_table('Score','SAT Section')

                  Score
SAT Section
Math         432.944000
Reading      424.504000
Writing      418.458667

In [63]:
sat.pivot_table('Score','Borough','SAT Section',aggfunc='max',margins=True, margins_name='Max value')

SAT Section    Math  Reading  Writing  Max value
Borough
Bronx           714      672      672        714
Brooklyn        682      608      606        682
Manhattan       754      697      693        754
Queens          701      640      661        701
Staten Island   711      660      670        711
Max value       754      697      693        754

# multiindex pivot tables

In [64]:
sat.pivot_table(values='Score',columns='SAT Section',index='School Name')

SAT Section                                         Math  Reading  Writing
School Name
A. Philip Randolph Campus High School                459      453      447
ACORN Community High School                          379      395      385
Abraham Lincoln High School                          441      422      422
Academy for Careers in Television and Film           444      458      444
Academy for College Preparation and Career Expl...   386      397      393
...                                                  ...      ...      ...
World Journalism Preparatory (College Board)         484      491      487
York Early College Academy                           496      481      473
Young Women's Leadership School                      478      465      472
Young Women's Leadership School in Astoria           483      464      477
Young Women's Leadership School in Queens            415      420      433

[375 rows x 3 columns]

In [65]:
sat.pivot_table(values='Score', index=['School Name','Borough'], columns='SAT Section')

,SAT Section,Math,Reading,Writing
School Name,Borough,,,
A. Philip Randolph Campus High School,Manhattan,459,453,447
ACORN Community High School,Brooklyn,379,395,385
Abraham Lincoln High School,Brooklyn,441,422,422
Academy for Careers in Television and Film,Queens,444,458,444
Academy for College Preparation and Career Exploration (College Board),Brooklyn,386,397,393
...,...,...,...,...
World Journalism Preparatory (College Board),Queens,484,491,487
York Early College Academy,Queens,496,481,473
Young Women's Leadership School,Manhattan,478,465,472
Young Women's Leadership School in Astoria,Queens,483,464,477
Young Women's Leadership School in Queens,Queens,415,420,433

In [66]:
sat.pivot_table(values='Score', columns=['School Name','Borough'], index='SAT Section')

School Name,A. Philip Randolph Campus High School,ACORN Community High School,Abraham Lincoln High School,Academy for Careers in Television and Film,Academy for College Preparation and Career Exploration (College Board),Academy for Conservation and the Environment,Academy for Environmental Leadership,Academy for Health Careers,Academy for Language and Technology,Academy for Scholarship and Entrepreneurship (College Board),...,Williamsburg High School for Architecture and Design,Williamsburg Preparatory School,Wings Academy,Women's Academy of Excellence,World Academy for Total Community Health High School,World Journalism Preparatory (College Board),York Early College Academy,Young Women's Leadership School,Young Women's Leadership School in Astoria,Young Women's Leadership School in Queens
Borough,Manhattan,Brooklyn,Brooklyn,Queens,Brooklyn,Brooklyn,Brooklyn,Brooklyn,Bronx,Bronx,...,Brooklyn,Brooklyn,Bronx,Bronx,Brooklyn,Queens,Queens,Manhattan,Queens,Queens
SAT Section,,,,,,,,,,,,,,,,,,,,,
Math,459,379,441,444,386,381,365,406,371,392,...,415,443,379,386,380,484,496,478,483,415
Reading,453,395,422,458,397,397,366,405,334,408,...,424,440,372,390,389,491,481,465,464,420
Writing,447,385,422,444,393,390,348,396,348,400,...,407,430,373,389,384,487,473,472,477,433

In [67]:
sat.pivot_table(values='Score', columns=['School Name','Borough'], index='SAT Section').T

,SAT Section,Math,Reading,Writing
School Name,Borough,,,
A. Philip Randolph Campus High School,Manhattan,459,453,447
ACORN Community High School,Brooklyn,379,395,385
Abraham Lincoln High School,Brooklyn,441,422,422
Academy for Careers in Television and Film,Queens,444,458,444
Academy for College Preparation and Career Exploration (College Board),Brooklyn,386,397,393
...,...,...,...,...
World Journalism Preparatory (College Board),Queens,484,491,487
York Early College Academy,Queens,496,481,473
Young Women's Leadership School,Manhattan,478,465,472
Young Women's Leadership School in Astoria,Queens,483,464,477
Young Women's Leadership School in Queens,Queens,415,420,433

In [68]:
sat.pivot_table(values='Score', columns=['School Name','Borough'], index='SAT Section').T.T

School Name,A. Philip Randolph Campus High School,ACORN Community High School,Abraham Lincoln High School,Academy for Careers in Television and Film,Academy for College Preparation and Career Exploration (College Board),Academy for Conservation and the Environment,Academy for Environmental Leadership,Academy for Health Careers,Academy for Language and Technology,Academy for Scholarship and Entrepreneurship (College Board),...,Williamsburg High School for Architecture and Design,Williamsburg Preparatory School,Wings Academy,Women's Academy of Excellence,World Academy for Total Community Health High School,World Journalism Preparatory (College Board),York Early College Academy,Young Women's Leadership School,Young Women's Leadership School in Astoria,Young Women's Leadership School in Queens
Borough,Manhattan,Brooklyn,Brooklyn,Queens,Brooklyn,Brooklyn,Brooklyn,Brooklyn,Bronx,Bronx,...,Brooklyn,Brooklyn,Bronx,Bronx,Brooklyn,Queens,Queens,Manhattan,Queens,Queens
SAT Section,,,,,,,,,,,,,,,,,,,,,
Math,459,379,441,444,386,381,365,406,371,392,...,415,443,379,386,380,484,496,478,483,415
Reading,453,395,422,458,397,397,366,405,334,408,...,424,440,372,390,389,491,481,465,464,420
Writing,447,385,422,444,393,390,348,396,348,400,...,407,430,373,389,384,487,473,472,477,433

# Applying multiple fuctions

In [70]:
# Previously:
sat.pivot_table('Score','Borough','SAT Section')

SAT Section          Math     Reading     Writing
Borough
Bronx          404.357143  402.520408  395.846939
Brooklyn       416.403670  410.761468  403.091743
Manhattan      455.887640  444.932584  439.314607
Queens         462.362319  443.260870  439.855072
Staten Island  486.200000  478.500000  474.300000

In [72]:
sat.pivot_table('Score','Borough','SAT Section', aggfunc='max')

SAT Section    Math  Reading  Writing
Borough
Bronx           714      672      672
Brooklyn        682      608      606
Manhattan       754      697      693
Queens          701      640      661
Staten Island   711      660      670

In [73]:
# Q: show the minimum and maximum SAT section scores by borough, in one pivot table

In [75]:
sat.pivot_table('Score','Borough','SAT Section', aggfunc=[np.min, np.max])

              amin                 amax
SAT Section   Math Reading Writing Math Reading Writing
Borough
Bronx          317     311     292  714     672     672
Brooklyn       319     302     284  682     608     606
Manhattan      344     330     316  754     697     693
Queens         340     320     318  701     640     661
Staten Island  420     427     409  711     660     670

In [ ]:
#np.min -> alias for np.amin

In [77]:
sat.pivot_table('Score','Borough','SAT Section', aggfunc=[np.min, np.max]).rename(axis=1, level=0 , mapper={'amin':'Minmum', 'amax':'Maximum'})

              Minmum                 Maximum
SAT Section     Math Reading Writing    Math Reading Writing
Borough
Bronx            317     311     292     714     672     672
Brooklyn         319     302     284     682     608     606
Manhattan        344     330     316     754     697     693
Queens           340     320     318     701     640     661
Staten Island    420     427     409     711     660     670

# Skill Challenge
1. Startnig with our main dataframe (sat), create a pivot table that summarizes the total student enrolment (Student Enrolment) across all 5 boroughs (Borough).
Which borough have the highest and lowest high school student bodies?

In [81]:
sat.head(n=2)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score,SAT Takers
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459,1001.96
1,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Reading,453,1001.96

In [88]:
student_enrollment = 'Student Enrollment'
sat.pivot_table(student_enrollment,'Borough', aggfunc='sum').sort_values(by=student_enrollment, ascending=False)

               Student Enrollment
Borough
Brooklyn                   242814
Queens                     232437
Manhattan                  170370
Bronx                      159267
Staten Island               55380

In [89]:
sat.pivot_table(student_enrollment,'Borough', aggfunc='sum').nlargest(50, columns=student_enrollment)

               Student Enrollment
Borough
Brooklyn                   242814
Queens                     232437
Manhattan                  170370
Bronx                      159267
Staten Island               55380

In [93]:
sat.pivot_table(student_enrollment, 'Borough', aggfunc='sum').idxmax()

Student Enrollment    Brooklyn
dtype: object

In [94]:
sat.pivot_table(student_enrollment, 'Borough', aggfunc='sum').idxmin()

Student Enrollment    Staten Island
dtype: object

2. Modify the pivot table from the step above to also reflect the avereage student body size (Student Enrolment) across boroughs, in the same pivot table.

In [97]:
sat.pivot_table(student_enrollment, 'Borough', aggfunc='mean')

               Student Enrollment
Borough
Bronx                  541.724490
Brooklyn               742.550459
Manhattan              638.089888
Queens                1122.884058
Staten Island         1846.000000

In [98]:
sat.pivot_table(student_enrollment, 'Borough', aggfunc=['sum', 'mean'])

                             sum               mean
              Student Enrollment Student Enrollment
Borough
Bronx                     159267         541.724490
Brooklyn                  242814         742.550459
Manhattan                 170370         638.089888
Queens                    232437        1122.884058
Staten Island              55380        1846.000000

3. Create a pivot table of high schools from the queens borough (Borough), containing the sat section scores (SAT Section, score) as columns and the school name (School Name) as index. Sort the table in descending order by math section scores.

In [100]:
sat.head(1)

,School Name,Borough,Student Enrollment,Percent Tested,SAT Section,Score,SAT Takers
0,A. Philip Randolph Campus High School,Manhattan,1354,74.0,Math,459,1001.96

In [103]:
sat[sat.Borough == 'Queens'].pivot_table('Score','School Name','SAT Section').sort_values(by=['Math'],ascending=False)

SAT Section                                         Math  Reading  Writing
School Name
Queens High School for the Sciences at York Col...   701      621      625
Townsend Harris High School                          680      640      661
Baccalaureate School for Global Education            633      620      628
Bard High School Early College Queens                631      598      610
Scholars' Academy                                    588      560      568
...                                                  ...      ...      ...
Middle College High School at LaGuardia Communi...   377      389      377
Queens High School for Information, Research, a...   372      362      352
August Martin High School                            366      372      364
Rockaway Park High School for Environmental Sus...   357      381      376
Pan American International High School               340      320      318

[69 rows x 3 columns]